<h1>Регулярні вирази</h1>
<p>
    <b>Мова регулярних виразів (Regular Expressions або regex)</b> - це потужний інструмент 
    для роботи з рядками в текстових данних. Основні елементи регулярних виразів 
    включають спецсимволи, групи, квантифікатори і якорі. 
</p>

<h2>Спецсимволи</h2>
<ul>
    <li><b>`.` (крапка):</b> Позначає будь-який символ, крім нового рядка</li>
    <li><b>`\` (зворотний слеш):</b> Використовується для екранування спецсимволів, таких як `.`, `\`, `+`, тощо</li>
</ul>
   
<h2>Групи</h2>
<ul>
    <li><b>`[]` (квадратні дужки):</b> Визначає набір символів, які можуть збігатися. Наприклад, 
        `[aeiou]` буде відповідати будь-якому голосному символу.</li>
    <li><b>`()` (круглі дужки):</b> Групує частини регулярного виразу, дозволяючи застосовувати 
        квантифікатори до цих частин.</li>
</ul>

<h2>Квантифікатори</h2>
<ul>
    <li><b>`*` (зірочка):</b> Відповідає 0 або більше входжень попереднього символу або групи.</li>
    <li><b>`+` (плюс):</b> Відповідає 1 або більше входжень попереднього символу або групи.</li>
    <li><b>`?` (знак питання):</b> Відповідає 0 або 1 входженню попереднього символу або групи.</li>
    <li><b>`{n}`:</b> Відповідає рівно n входженням попереднього символу або групи.</li>
    <li><b>`{n,}`:</b> Відповідає n або більше входженням попереднього символу або групи.</li>
    <li><b>`{n,m}`:</b> Відповідає від n до m входжень попереднього символу або групи.</li>
</ul>

<h2>Якорі</h2>
<ul>
    <li><b>`^` (каретка):</b> Вказує на початок рядка.</li>
    <li><b>`$`:</b> Вказує на кінець рядка.</li>
    <li><b>`\b`:</b> Вказує на границю слова (слово має починатися або закінчуватися).</li>
</ul>

<h3>Приклад регулярного виразу для знаходження електронної пошти:</h3>

<p>
    <code>^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$</code>
</p>

<p>У цьому виразі:</p>
<ul>
    <li><b>`^`</b> вказує на початок рядка.</li>
    <li><b>`[a-zA-Z0-9._%+-]+`</b> відповідає локальній частині електронної пошти.</li>
    <li><b>`@`</b> відповідає символу "@", який є обов'язковим.</li>
    <li><b>`[a-zA-Z0-9.-]+`</b> відповідає доменній частині електронної пошти.</li>
    <li><b>`\.`</b> відповідає крапці, яка є обов'язковою перед розширенням домену.</li>
    <li><b>`[a-zA-Z]{2,}`</b> відповідає розширенню домену (наприклад, com, org, net) 
        довжиною щонайменше 2 символи.</li>
    <li><b>`$`</b> вказує на кінець рядка.</li>
</ul>